docs/posts/2010-12-16-bob-feller-1918-20-10.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bob Feller (1918-2010)</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Bob Feller (1918-2010)</h1>
<p class="subtitle" role="doc-subtitle">Dec 16, 2010</p>
</header><p>
Bob Feller, who pitched for the Cleveland Indians from 1936 to 1956, <a href="http://www.nytimes.com/2010/12/16/sports/baseball/16feller.html?scp=1&amp;amp;sq=%22bob%20feller%22&amp;amp;st=cse">died Wednesday</a> in Cleveland. In Alan Schwarz&rsquo;s 2006 book, <i>Once Upon a Game: Baseball&rsquo;s Greatest Memories</i>, he spoke of his decision to leave professional baseball after the 1941 attack on Pearl Harbor and enlist in the United States Navy.
</p>

<blockquote>
<p>
A lot of folks say that had I not missed those almost four seasons to World War II — during what was probably my physical prime — I might have had 370 or even 400 wins. But I have no regrets. None at all. I did what any American could and should do: serve his country in its time of need. The world’s time of need.
</p>

<p>
I knew then, and I know today, that winning World War II was the most important thing to happen to this country in the last 100 years. I’m just glad I was a part of it.
</p>
</blockquote>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
